src/Documents/ОтчетОРаботеСистемы/ОтчетОРаботеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОРаботеСистемы</name>
</mdclass:Document>

src/InformationRegisters/СостояниеНоменклатуры/СостояниеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеНоменклатуры</name>
  <comment>Описывает все возможные состояния номенклатуры</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЭксплуатации</name>
    <comment>Пустая ссылка - все нормально, иначе см. основание</comment>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусСтанций/СтатусСтанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусСтанций</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </resources>
  <dimensions>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСтанций/СтатусыСтанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСтанций</name>
  <enumValues>
    <name>Ок</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>ПрофилактическиеРаботы</name>
  </enumValues>
  <enumValues>
    <name>РаботыПоУлучшению</name>
  </enumValues>
  <enumValues>
    <name>РемонтныеРаботы</name>
  </enumValues>
  <enumValues>
    <name>Демонтаж</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОтчетОРаботеСистемы/ManagerModule.bsl
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.ОтчетОРаботеСистемы);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КОЛИЧЕСТВО(СостояниеНоменклатурыСрезПоследних.Товар) КАК КоличествоТоваров,
		|	КОЛИЧЕСТВО(СтатусСтанцийСрезПоследних.Станция) КАК ИзНихРаботают
		|ПОМЕСТИТЬ КолвоТоваров
		|ИЗ
		|	РегистрСведений.СостояниеНоменклатуры.СрезПоследних(&Период,) КАК СостояниеНоменклатурыСрезПоследних,
		|	РегистрСведений.СтатусСтанций.СрезПоследних КАК СтатусСтанцийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРаботеСистемы КАК ОтчетОРаботеСистемы
		|		ПО ИСТИНА
		|ГДЕ
		|	ОтчетОРаботеСистемы.Ссылка В (&Ссылка)
		|	И СтатусСтанцийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСтанций.Ок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КОЛИЧЕСТВО(СостояниеНоменклатурыСрезПоследних.Товар) КАК ИзНихВЭксплуатации,
		|	Среднее(КолвоТоваров.КоличествоТоваров) КАК КоличествоТоваров,
		|	КОЛИЧЕСТВО(ТипыНоменклатуры.Ссылка) КАК КоличествоТиповНоменклатуры,
		|	КОЛИЧЕСТВО(СтатусСтанцийСрезПоследних.Станция) КАК КоличествоСтанцийВсего
		|ИЗ
		|	РегистрСведений.СостояниеНоменклатуры.СрезПоследних(&Период,) КАК СостояниеНоменклатурыСрезПоследних,
		|	Документ.ОтчетОРаботеСистемы КАК ОтчетОРаботеСистемы,
		|	КолвоТоваров КАК КолвоТоваров,
		|	Справочник.ТипыНоменклатуры КАК ТипыНоменклатуры,
		|	РегистрСведений.СтатусСтанций.СрезПоследних КАК СтатусСтанцийСрезПоследних
		|ГДЕ
		|	ОтчетОРаботеСистемы.Ссылка В (&Ссылка)
		|	И
		|		СостояниеНоменклатурыСрезПоследних.СостояниеЭксплуатации = ЗНАЧЕНИЕ(Перечисление.ОснованияВыводаТовараИзЭксплуатации.ПустаяСсылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("Период", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьОсновная = Макет.ПолучитьОбласть("Основная");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьОсновная.Параметры.Заполнить(Выборка);
		ОбластьОсновная.Параметры["Заголовок"] = "Отчет о работе системы аренды на " + Формат(ТекущаяДатаСеанса(), "ДФ='d MMMM yyyy ''года'''");
		ТабДок.Вывести(ОбластьОсновная, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
		Прервать;
	КонецЦикла;
	//}}
КонецПроцедуры
